backend/load/load-test.yml
config:
  target: 'http://localhost:5001'
  phases:
    - duration: 60
      arrivalRate: 10
      rampTo: 100
      name: 'Ramp up traffic'
    - duration: 120
      arrivalRate: 100
      name: 'Sustained peak load'
scenarios:
  - flow:
      - post:
          url: '/api/auth/login'
          json:
            email: 'mel@test.com.au'
            password: 'meli'
          capture:
            - json: '$.token'
              as: 'authToken'
      - get:
          url: '/api/userevents'
          headers:
            Authorization: 'Bearer {{ authToken }}'